tutorials/pisoFoamHFDIB/cylinder/Allrun
#!/bin/sh

cp 0.org/* 0/.
blockMesh
decomposePar -force
mpirun -np 4 pisoFoamHFDIB -parallel


# ----------------------------------------------------------------- end-of-file
